Courses/4420/Lectures/SecSoftware/Labs/secsoftware-lab2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-05 Thu 21:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lab: Software without Security Holes #2</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
2019-09-22 | <a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Lab: Software without Security Holes #2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5eef31f">1. Background</a></li>
<li><a href="#org60cfa2d">2. Tasks</a>
<ul>
<li><a href="#orgfa455a4">2.1. Task: Experience A Past Exploit: ShellShock [20 points]</a></li>
<li><a href="#org6afd832">2.2. Task: System Program fusermount  [20 points]</a></li>
<li><a href="#orgbea94a8">2.3. Task: CERT Coding Guides  [20 points]</a></li>
<li><a href="#orgd9c8832">2.4. Task: Assert fusermount [20 points]</a></li>
</ul>
</li>
<li><a href="#orga392927">3. Tasks: [Bonus][Optional]</a>
<ul>
<li><a href="#org05b0c20">3.1. Task: Static Analysis Tool LLVM Clang-Analyzer [20 points]</a></li>
<li><a href="#org3a47e35">3.2. Task: CodeChecker [20 points]</a></li>
<li><a href="#org8a4e9ab">3.3. Task: Comparative Review [20 points]</a></li>
</ul>
</li>
<li><a href="#orga281e05">4. Submission</a></li>
<li><a href="#org9bed05b">5. References</a></li>
<li><a href="#org6553993">6. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5eef31f" class="outline-2">
<h2 id="org5eef31f"><span class="section-number-2">1</span> Background</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Should have completed Lab on Software without Security Holes #1</li>

<li>System Programs: <code>mount, fusermount, sudo, su, passwd, chsh</code>, &#x2026;  We
expect these to be free of security holes.</li>

<li>Example ordinary/ non-system programs/ utilities: <code>cat, ls, date,
   make</code>, and even <code>login, bash, ash, dash, csh, zsh</code> and other
shells.  [I suppose we could relax our expectations on these.]</li>

<li><a href="http://cwe.mitre.org/data/definitions/264.html">http://cwe.mitre.org/data/definitions/264.html</a> CWE CATEGORY:
Permissions, Privileges, and Access Controls</li>
</ol>
</div>
</div>

<div id="outline-container-org60cfa2d" class="outline-2">
<h2 id="org60cfa2d"><span class="section-number-2">2</span> Tasks</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgfa455a4" class="outline-3">
<h3 id="orgfa455a4"><span class="section-number-3">2.1</span> Task: Experience A Past Exploit: ShellShock [20 points]</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Background: Learn about ShellShock 2014 bug in <code>bash</code>.  Older
versions of Bash can be tricked into executing arbitrary commands.
Study these:
<ol class="org-ol">
<li><a href="https://en.wikipedia.org/wiki/Shellshock_(software_bug)">https://en.wikipedia.org/wiki/Shellshock_(software_bug)</a></li>
<li><a href="https://www.sophos.com/hu-hu/lp/bash-shellshock.aspx">https://www.sophos.com/hu-hu/lp/bash-shellshock.aspx</a></li>
<li><a href="https://www.owasp.org/images/1/1b/Shellshock_-_Tudor_Enache.pdf">https://www.owasp.org/images/1/1b/Shellshock_-_Tudor_Enache.pdf</a>
25 slides,</li>
</ol></li>

<li>Background: ShellShock:: <a href="https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2014-6271">CVE-2014-6271</a> "GNU Bash through 4.3
processes trailing strings after function definitions in the values
of environment variables, which allows remote attackers to execute
arbitrary code via a crafted environment, as demonstrated by
vectors involving the ForceCommand feature in OpenSSH sshd, the
mod<sub>cgi</sub> and mod<sub>cgid</sub> modules in the Apache HTTP Server, scripts
executed by unspecified DHCP clients, and other situations in which
setting the environment occurs across a privilege boundary from
Bash execution, aka "ShellShock." NOTE: the original fix for this
issue was incorrect; CVE-2014-7169 has been assigned to cover the
vulnerability that is still present after the incorrect fix."
[Refresh your hold on <code>bash</code> syntax and usage.]</li>

<li>Background: ShellShock Further Refs
<ol class="org-ol">
<li><a href="https://www.us-cert.gov/ncas/alerts/TA14-268A">https://www.us-cert.gov/ncas/alerts/TA14-268A</a>;</li>
<li><a href="https://www.cybrary.it/0p3n/shellshock-all-you-need-to-know-about-the-bash-bug-vulnerability/">https://www.cybrary.it/0p3n/shellshock-all-you-need-to-know-about-the-bash-bug-vulnerability/</a></li>
<li><a href="https://security.stackexchange.com/questions/68448/where-is-bash-shellshock-vulnerability-in-source-code">https://security.stackexchange.com/questions/68448/where-is-bash-shellshock-vulnerability-in-source-code</a></li>
</ol></li>
</ol>


<ol class="org-ol">
<li>[5 points] Check if bash, as is, in a modern Linux has this vulnerability.
Include details of the bash version.  Describe in detail how you
checked.  Develop a detection script.</li>

<li>[15 points] Download a version claimed in the articles above as
being vulnerable from <a href="http://ftp.gnu.org/gnu/bash/">http://ftp.gnu.org/gnu/bash/</a>, which has older
and current versions of bash.  Build it.  Rename the current
<code>/bin/bash</code> as <code>/bin/bash-orig</code> .  Install the one you built as
<code>/bin/bash</code>.  Verify that this version of bash has the
vulnerability.  Include details of the bash version you installed.
Describe in detail how you verified.  Develop a script that
demonstrates.</li>
</ol>
</div>
</div>

<div id="outline-container-org6afd832" class="outline-3">
<h3 id="org6afd832"><span class="section-number-3">2.2</span> Task: System Program fusermount  [20 points]</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Background: FUSE and <code>fusermount</code>
<a href="https://en.wikipedia.org/wiki/Filesystem_in_Userspace">https://en.wikipedia.org/wiki/Filesystem_in_Userspace</a> Filesystem in
UserSpace. Read <code>man fusermount</code>.   Required Reading.</li>

<li>Background: Study FUSE documentation from within the kernel source tree:
<a href="https://www.kernel.org/doc/Documentation/filesystems/fuse.txt">https://www.kernel.org/doc/Documentation/filesystems/fuse.txt</a>,</li>

<li>Background: CVE on fusermount: Become aware of <a href="https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-10906">CVE-2018-10906</a>.  "fusermount is vulnerable to a
restriction bypass when SELinux is active. This allows non-root
users to mount a FUSE file system with the 'allow-other' mount
option regardless of whether 'user-allow-other' is set in the
fuse configuration. An attacker may use this flaw to mount a
FUSE file system, accessible by other users, and trick them into
accessing files on that file system, possibly causing Denial of
Service or other unspecified effects."  [We
will try to revisit this topic after SELinux lectures.]</li>
<li>Background: CVE on fusermount: Become aware of <a href="https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2015-3202">CVE-2015-3202</a> "fusermount in FUSE before 2.9.3-15 does not
properly clear the environment before invoking (1) mount or (2)
umount as root, which allows local users to write to arbitrary
files via a crafted LIBMOUNT<sub>MTAB</sub> environment variable that is
used by mount's debugging feature."</li>
<li>HeartBleed:: Discovered in 2014, about the same time as shellshock.
The bug is in SSL networking.  Not part of this course.</li>
</ol>


<ol class="org-ol">
<li>[15] Download from <a href="https://github.com/libfuse/libfuse">https://github.com/libfuse/libfuse</a>.  Build it,
following the <a href="https://github.com/libfuse/libfuse#installation">Installation</a> guide.  Become familiar with its files.
Understand <a href="https://github.com/libfuse/libfuse#security-implications">security-implications</a>.</li>

<li>[05] Check that the just built fusermount works.  Describe in
detail how you verified.  Develop a script that demonstrates.</li>
</ol>
</div>
</div>

<div id="outline-container-orgbea94a8" class="outline-3">
<h3 id="orgbea94a8"><span class="section-number-3">2.3</span> Task: CERT Coding Guides  [20 points]</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>Coding Guides:: For C and C++: Part of this course.  For Java: Not
part of this course.</li>

<li>What is the role of a computer emergency response team? A Computer
Emergency Response Team (CERT) is a group of information security
experts responsible for the protection against, detection of and
response to an organization's cybersecurity incidents. [web search
result, June 2019] [There is a CERT in many countries.]</li>

<li>Background: Become familiar with <a href="https://wiki.sei.cmu.edu/confluence/display/c/SEI+CERT+C+Coding+Standard">CERT Coding Guide on C</a>.
Understand the following coding rules deeply.
<ol class="org-ol">
<li><a href="https://wiki.sei.cmu.edu/confluence/display/c/EXP39-C.+Do+not+access+a+variable+through+a+pointer+of+an+incompatible+type">EXP39-C</a>. Do not access a variable through a pointer of an
incompatible type</li>
<li><a href="https://wiki.sei.cmu.edu/confluence/display/c/EXP45-C.+Do+not+perform+assignments+in+selection+statements">EXP45-C</a>. Do not perform assignments in selection statements</li>
</ol></li>
</ol>


<ol class="org-ol">
<li>Analyze, manually, the source code of <a href="https://github.com/libfuse/libfuse/blob/master/util/fusermount.c">fusermount.c</a> for any
violations of the above rules.  Discover and explain at least two
violations.</li>
</ol>
</div>
</div>

<div id="outline-container-orgd9c8832" class="outline-3">
<h3 id="orgd9c8832"><span class="section-number-3">2.4</span> Task: Assert fusermount [20 points]</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>Background: Learn assert.h.  <a href="https://en.wikipedia.org/wiki/Assert.h">https://en.wikipedia.org/wiki/Assert.h</a></li>
</ol>


<ol class="org-ol">
<li>Give an entry assertion, an exit assertion, and a loop invariant
for <b>two</b> non-trivial (&gt; 15 SLOC) functions/ procedures of
<a href="https://github.com/libfuse/libfuse/blob/master/util/fusermount.c">fusermount.c</a>.</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-orga392927" class="outline-2">
<h2 id="orga392927"><span class="section-number-2">3</span> Tasks: [Bonus][Optional]</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org05b0c20" class="outline-3">
<h3 id="org05b0c20"><span class="section-number-3">3.1</span> Task: Static Analysis Tool LLVM Clang-Analyzer [20 points]</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>Background: <a href="https://clang-analyzer.llvm.org/">https://clang-analyzer.llvm.org/</a> LLVM Clang-Analyzer</li>
<li>Background:  <a href="http://btorpey.github.io/blog/2015/04/27/static-analysis-with-clang/">http://btorpey.github.io/blog/2015/04/27/static-analysis-with-clang/</a></li>
<li>Background:  <a href="https://developer.mozilla.org/en-US/docs/Mozilla/Testing/Clang_static_analysis">https://developer.mozilla.org/en-US/docs/Mozilla/Testing/Clang_static_analysis</a></li>
</ol>


<ol class="org-ol">
<li>Analyze, using <code>scan-build</code>, the source code of <a href="https://github.com/libfuse/libfuse/blob/master/util/fusermount.c">fusermount.c</a>.
Report on your findings.</li>
</ol>
</div>
</div>

<div id="outline-container-org3a47e35" class="outline-3">
<h3 id="org3a47e35"><span class="section-number-3">3.2</span> Task: CodeChecker [20 points]</h3>
<div class="outline-text-3" id="text-3-2">
<ol class="org-ol">
<li>Background: <a href="https://github.com/Ericsson/codechecker">https://github.com/Ericsson/codechecker</a> CodeChecker is
a static analysis infrastructure built on the LLVM/Clang Static
Analyzer toolchain, replacing <code>scan-build</code> in a Linux or OS-X
development environment.</li>
</ol>


<ol class="org-ol">
<li>Analyze, using <code>codechecker</code>, the source code of <a href="https://github.com/libfuse/libfuse/blob/master/util/fusermount.c">fusermount.c</a>.    Report on your findings.</li>
</ol>
</div>
</div>

<div id="outline-container-org8a4e9ab" class="outline-3">
<h3 id="org8a4e9ab"><span class="section-number-3">3.3</span> Task: Comparative Review [20 points]</h3>
<div class="outline-text-3" id="text-3-3">
<ol class="org-ol">
<li>Write a comparative review of the tools used in this lab, and in
previous lab SecSoftware#1.  Ok to do the write up based just on
reading about the tools, but it is better if it based on experience
of having used them long enough.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orga281e05" class="outline-2">
<h2 id="orga281e05"><span class="section-number-2">4</span> Submission</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>[10 points] Lab Report quality.</li>

<li>You must follow the Lab Report Template. There should be a section
on each of the tasks. A couple of lines of an answer to each
(implied/ explicit) question/ discussion item.  Must number it as
in this document.</li>

<li>Use good judgement and do not make the report way longer than, say,
20 pages. Submit explanations and code that verifies your answers.</li>

<li>[10 points] Include a journal.  By the hour.</li>

<li>Submit a PDF file named exactly <code>Report-Lx.pdf</code> [x is a single
digit; lookup the value of x on the home page], and a tarball
<code>Lx.tbz</code> [use <code>tar cfjvv Lx.tbz source-files*</code> ]. (Scripts are used
to check various things &#x2013; so file names should obey such "rules".)</li>
</ol>
</div>
</div>


<div id="outline-container-org9bed05b" class="outline-2">
<h2 id="org9bed05b"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Prabhaker Mateti, <a href="../../SecSoftware/index.html">Software Development without Security
Holes</a>, 2019. Required Reading.</li>
</ol>
</div>
</div>




<div id="outline-container-org6553993" class="outline-2">
<h2 id="org6553993"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2019 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2019-09-22
</div>
</body>
</html>
